package com.sist.main;
/*
 *     자바 
 *      데이터저장 : 변수 , 배열 , 클래스 
 *      -------- 기본형 
 *      명령 => 연산자 / 제어문 (처리)
 *      메소드 
 *      --------
 *      클래스 : 변수 , 메소드 , 생성자 
 *             ---          ----- 초기화 (초기화블록)
 *             변수의 종류 (static , instance)
 *      재사용 : 객체 지향 
 *        => 캡슐화 
 *        => 상속 , 포함 
 *        => 다형성(오버로딩 , 오버라이딩) 
 *      -------------------------------
 *       사용법 => 상속 (형변환)
 *      -------------------------------
 *      
 *      클래스의 종류 (375)
 *       = 추상 클래스 : 설계도 (미완성된 클래스)
 *                    => 필요시마다 완성해서 사용한다 
 *                    => 요구사항 분석 
 *                    => 기능 설계 (메소드) => 오버라이딩후 사용 
 *          public abstract class ClassName
 *          {
 *              //1.변수 설정 
 *              //2.구현된 메소드 
 *              //3.구현이 안된 메소드 => 메모리 저장이 안된다 (하위 클래스)
 *              A a=new B();
 *          }
 *          => 여러개의 클래스를 모아서 관리 (한개의 클래스이름으로 제어)
 *          => 추상 클래스
 *             => new (X) , new (클래스 != 생성자)
 *                클래스 a=new 클래스()
 *          => 단일 상속 
 *          => 추상 클래스는 클래스를 모아서 관리 
 *          *** 변수 / 클래스 => 모아서 한개의 이름으로 제어 
 *       = 인터페이스 : 추상 클래스를 보완 => 다중 상속이 가능 (스프링)
 *          => 구현안된 메소드 => 구현된 메소드가 가능 
 *       = 내부 클래스 
 *         = 멤버 클래스
 *         = 익명의 클래스
 *         = 지역 클래스
 *       = 종단 클래스 
 *     --------------------------------
 *      에러를 사전에 방지하는 프로그램 (예외처리) => 8
 *      라이브러리 (9~) 
 *      ------------- 조립 (알고리즘) : 순서
 *      프로그램 : 문법 , 소스를 암기(X) , 순서기억 
 *      -----------------------------------
 *        => 반복 
 *        
 *             
 */
public class MainClass {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
