/*
 *   쉬프트연산자 (비트이동연산자) 
 *     << 왼쪽이동 
 *     >> 오른쪽
 *     
 *     예)
 *          10<<2
 *          1010 ==> 뒤에 0을 2개 채운다 
 *        101000
 *        ------ => 40 (왼쪽이동이면 증가)
 *          15<<3
 *          1111
 *       1111000
 *       ------- 120
 *       64+32+16+8 ==> 120
 *       
 *    예)
 *         10>>2
 *         1010 => 뒤에서 2개를 제거 
 *           --
 *         10 => 2
 *         
 *         15>>3
 *         1(111) => 1
 *         
 *         1) X<<Y
 *            X*2^y
 *            
 *            10<<2   ==> 10*2^2 ==> 40
 *            15<<3   ==> 15*2^3 => 15*8 => 120
 *            
 *         2) X>>Y
 *            X/2^y
 *            
 *            10>>2   => 10/4 => 2
 *            15>>3   => 15/8 => 1
 *            
 *            5/2 => 2.5
 *            5/2 => 소수점 제거 => 2 (정수/정수=정수)
 *       ------------------ 산술연산자      
 *         
 *         
 */
public class 쉬프트연산자_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
        System.out.println(10<<2);
        System.out.println(15<<3);
        System.out.println(10>>2);//2
        System.out.println(15>>3);//1
	}

}
